// f12 -> Application -> strorages -> coockies

// name - имя куки для обращения
// value - само значение которое хранится в куке
// Domain - сфйт на который кука будет отправляться (домен)
// Path - для какой конкретной части роута будет предназначен кука
// Expires - очначает время жизни от пары часов до нескольких дней
// size - размер
// HTTP only - true/false означает можно ли воздействовать на куку из Javascript (false значит можно)
// secure - true/false значит кука сработает если запрос делается через HTTPS, то есть защищеное соединение
